## 데이터 준비

- CCTV_in_Seoul.csv (서울시 자치구 연도별 CCTV 설치 현황, 2019/04)
- Population_in_Seoul.xls (서울시 인구, 2019/04)

In [2]:
import pandas as pd

### CSV 읽기

In [3]:
CCTV_Seoul = pd.read_csv('data/CCTV_in_Seoul.csv', encoding='utf-8')

### 첫번째 5행만 보기

In [4]:
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

### 컬럼 보기 / 컬럼명 변경

In [5]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [7]:
CCTV_Seoul.columns[0]

'기관명'

In [8]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: '구별'}, inplace=True)

In [9]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

### 엑셀 읽기

In [12]:
pop_Seoul = pd.read_excel('data/Population_in_Seoul.xls', encoding='utf-8')

In [13]:
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2018,합계,4263868,10049607,4910849,5138758,9765623,4773899,4991724,283984,136950,147034,2.29,1416131
3,2018,종로구,73735,163026,79156,83870,153065,74825,78240,9961,4331,5630,2.08,26742
4,2018,중구,61502,135633,66674,68959,125725,61947,63778,9908,4727,5181,2.04,22005

In [15]:
pop_Seoul = pd.read_excel('data/Population_in_Seoul.xls',
                          header=2,
                          usecols='B, D, G, J, N',
                          encoding='utf-8')

In [16]:
pop_Seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10049607  9765623  283984   1416131
1  종로구    163026   153065    9961     26742
2   중구    135633   125725    9908     22005
3  용산구    245090   228999   16091     37640
4  성동구    316463   308221    8242     42767

### 컬럼명 변경

In [18]:
pop_Seoul.rename(columns={
    pop_Seoul.columns[0] : '구별',
    pop_Seoul.columns[1] : '인구수',
    pop_Seoul.columns[2] : '한국인',
    pop_Seoul.columns[3] : '외국인',
    pop_Seoul.columns[4] : '고령자'}, inplace=True)

In [19]:
pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10049607  9765623  283984  1416131
1  종로구    163026   153065    9961    26742
2   중구    135633   125725    9908    22005
3  용산구    245090   228999   16091    37640
4  성동구    316463   308221    8242    42767

## pandas 기초

In [20]:
import pandas as pd
import numpy as np

In [21]:
pd.Series([1, 3, 5, np.nan, 6, 8])

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [23]:
dates = pd.date_range('20190415', periods=6)

In [24]:
dates

DatetimeIndex(['2019-04-15', '2019-04-16', '2019-04-17', '2019-04-18',
               '2019-04-19', '2019-04-20'],
              dtype='datetime64[ns]', freq='D')

In [26]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=['A', 'B', 'C', 'D'])

In [27]:
df

                   A         B         C         D
2019-04-15 -2.529243 -0.455009 -0.580589 -0.550960
2019-04-16  0.560353 -1.956939  0.379401 -0.446995
2019-04-17  1.327824 -0.735898  0.247990 -1.681843
2019-04-18 -0.508784  0.843627  2.154598 -0.607562
2019-04-19 -0.162442 -1.245663 -2.164917  0.475302
2019-04-20  1.057715  1.113136  0.045672  0.730952

In [28]:
df.head(3)

                   A         B         C         D
2019-04-15 -2.529243 -0.455009 -0.580589 -0.550960
2019-04-16  0.560353 -1.956939  0.379401 -0.446995
2019-04-17  1.327824 -0.735898  0.247990 -1.681843

In [29]:
df.index

DatetimeIndex(['2019-04-15', '2019-04-16', '2019-04-17', '2019-04-18',
               '2019-04-19', '2019-04-20'],
              dtype='datetime64[ns]', freq='D')

In [30]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [31]:
df.values

array([[-2.52924251, -0.45500939, -0.58058938, -0.55096024],
       [ 0.56035265, -1.95693878,  0.37940112, -0.44699454],
       [ 1.32782417, -0.73589809,  0.24798954, -1.68184335],
       [-0.50878436,  0.84362749,  2.15459844, -0.60756249],
       [-0.16244229, -1.24566327, -2.16491705,  0.47530205],
       [ 1.0577146 ,  1.11313585,  0.04567183,  0.73095225]])

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2019-04-15 to 2019-04-20
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [33]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.042430 -0.406124  0.013692 -0.346851
std    1.404805  1.190884  1.405180  0.864807
min   -2.529243 -1.956939 -2.164917 -1.681843
25%   -0.422199 -1.118222 -0.424024 -0.593412
50%    0.198955 -0.595454  0.146831 -0.498977
75%    0.933374  0.518968  0.346548  0.244728
max    1.327824  1.113136  2.154598  0.730952

In [34]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2019-04-20  1.057715  1.113136  0.045672  0.730952
2019-04-18 -0.508784  0.843627  2.154598 -0.607562
2019-04-15 -2.529243 -0.455009 -0.580589 -0.550960
2019-04-17  1.327824 -0.735898  0.247990 -1.681843
2019-04-19 -0.162442 -1.245663 -2.164917  0.475302
2019-04-16  0.560353 -1.956939  0.379401 -0.446995

In [35]:
df['A']

2019-04-15   -2.529243
2019-04-16    0.560353
2019-04-17    1.327824
2019-04-18   -0.508784
2019-04-19   -0.162442
2019-04-20    1.057715
Freq: D, Name: A, dtype: float64

In [36]:
df[0:3]

                   A         B         C         D
2019-04-15 -2.529243 -0.455009 -0.580589 -0.550960
2019-04-16  0.560353 -1.956939  0.379401 -0.446995
2019-04-17  1.327824 -0.735898  0.247990 -1.681843

In [37]:
df['20190416':'20190418']

                   A         B         C         D
2019-04-16  0.560353 -1.956939  0.379401 -0.446995
2019-04-17  1.327824 -0.735898  0.247990 -1.681843
2019-04-18 -0.508784  0.843627  2.154598 -0.607562

In [38]:
dates[0]

Timestamp('2019-04-15 00:00:00', freq='D')

In [39]:
df.loc[dates[0]]

A   -2.529243
B   -0.455009
C   -0.580589
D   -0.550960
Name: 2019-04-15 00:00:00, dtype: float64

In [40]:
df.loc[:, ['A', 'B']]

                   A         B
2019-04-15 -2.529243 -0.455009
2019-04-16  0.560353 -1.956939
2019-04-17  1.327824 -0.735898
2019-04-18 -0.508784  0.843627
2019-04-19 -0.162442 -1.245663
2019-04-20  1.057715  1.113136

In [41]:
df.loc['20190415':'20190416', ['B', 'C']]

                   B         C
2019-04-15 -0.455009 -0.580589
2019-04-16 -1.956939  0.379401

In [42]:
df.loc[dates[1], 'A']

0.5603526506973054

In [43]:
df.iloc[3]

A   -0.508784
B    0.843627
C    2.154598
D   -0.607562
Name: 2019-04-18 00:00:00, dtype: float64

In [44]:
df.iloc[3:5, 0:2]

                   A         B
2019-04-18 -0.508784  0.843627
2019-04-19 -0.162442 -1.245663

In [45]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2019-04-16  0.560353  0.379401
2019-04-17  1.327824  0.247990
2019-04-19 -0.162442 -2.164917

In [46]:
df.iloc[1:3, :]

                   A         B         C         D
2019-04-16  0.560353 -1.956939  0.379401 -0.446995
2019-04-17  1.327824 -0.735898  0.247990 -1.681843

In [47]:
df.iloc[:, 1:3]

                   B         C
2019-04-15 -0.455009 -0.580589
2019-04-16 -1.956939  0.379401
2019-04-17 -0.735898  0.247990
2019-04-18  0.843627  2.154598
2019-04-19 -1.245663 -2.164917
2019-04-20  1.113136  0.045672

In [48]:
df

                   A         B         C         D
2019-04-15 -2.529243 -0.455009 -0.580589 -0.550960
2019-04-16  0.560353 -1.956939  0.379401 -0.446995
2019-04-17  1.327824 -0.735898  0.247990 -1.681843
2019-04-18 -0.508784  0.843627  2.154598 -0.607562
2019-04-19 -0.162442 -1.245663 -2.164917  0.475302
2019-04-20  1.057715  1.113136  0.045672  0.730952

In [49]:
df[df.A > 0]

                   A         B         C         D
2019-04-16  0.560353 -1.956939  0.379401 -0.446995
2019-04-17  1.327824 -0.735898  0.247990 -1.681843
2019-04-20  1.057715  1.113136  0.045672  0.730952

In [50]:
df[df > 0]

                   A         B         C         D
2019-04-15       NaN       NaN       NaN       NaN
2019-04-16  0.560353       NaN  0.379401       NaN
2019-04-17  1.327824       NaN  0.247990       NaN
2019-04-18       NaN  0.843627  2.154598       NaN
2019-04-19       NaN       NaN       NaN  0.475302
2019-04-20  1.057715  1.113136  0.045672  0.730952

In [51]:
df2 = df.copy()

In [52]:
df2

                   A         B         C         D
2019-04-15 -2.529243 -0.455009 -0.580589 -0.550960
2019-04-16  0.560353 -1.956939  0.379401 -0.446995
2019-04-17  1.327824 -0.735898  0.247990 -1.681843
2019-04-18 -0.508784  0.843627  2.154598 -0.607562
2019-04-19 -0.162442 -1.245663 -2.164917  0.475302
2019-04-20  1.057715  1.113136  0.045672  0.730952

In [54]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [55]:
df2

                   A         B         C         D      E
2019-04-15 -2.529243 -0.455009 -0.580589 -0.550960    one
2019-04-16  0.560353 -1.956939  0.379401 -0.446995    one
2019-04-17  1.327824 -0.735898  0.247990 -1.681843    two
2019-04-18 -0.508784  0.843627  2.154598 -0.607562  three
2019-04-19 -0.162442 -1.245663 -2.164917  0.475302   four
2019-04-20  1.057715  1.113136  0.045672  0.730952  three

In [56]:
df2['E'].isin(['two', 'four'])

2019-04-15    False
2019-04-16    False
2019-04-17     True
2019-04-18    False
2019-04-19     True
2019-04-20    False
Freq: D, Name: E, dtype: bool

In [57]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2019-04-17  1.327824 -0.735898  0.247990 -1.681843   two
2019-04-19 -0.162442 -1.245663 -2.164917  0.475302  four

In [60]:
# 누적합
df.apply(np.cumsum)

                   A         B         C         D
2019-04-15 -2.529243 -0.455009 -0.580589 -0.550960
2019-04-16 -1.968890 -2.411948 -0.201188 -0.997955
2019-04-17 -0.641066 -3.147846  0.046801 -2.679798
2019-04-18 -1.149850 -2.304219  2.201400 -3.287361
2019-04-19 -1.312292 -3.549882  0.036483 -2.812059
2019-04-20 -0.254578 -2.436746  0.082155 -2.081106

In [61]:
df.apply(lambda x: x.max() - x.min())

A    3.857067
B    3.070075
C    4.319515
D    2.412796
dtype: float64